<aside>
💡 **Java의 클래스에 대한 복습 및 이해**

</aside>

---

### 클래스와 객체가 필요한 이유

---

- 변수만 사용해서 정보들을 저장하려고 함.
    - 정보가 늘어 날 때마다 변수 및 출력문을 하나하나 계속 늘려야함.
    - 그래서 실수가 많아지거나 코드도 굉장히 복잡해짐.
    - 같은 의미의 변수가 반복되기 때문임.
    - 그런 까닭에 배열이라는 자료 구조를 사용하기 시작함.
    
    ---
    
- **ClassStart1**
    
    ```java
    package class1;
    
    public class ClassStart1 {
    	
    	// 학생 정보 출력 프로그램
    	// 두 명의 학생 정보를 출력하는데, 각 학생은 이름, 나이, 성적을 가지고 있음.
    			
    	// 1. 홍길동, 15, 90
    	// 2. 장발장, 16, 80
    			
    	// 출력 - 이름 : [이름] 나이 : [나이]세 성적 : [성적]점
    			
    	// 변수를 사용하여 학생 정보를 저장하고, 변수를 사용해서 학생 정보를 출력해보자.
    					
    	public static void main(String[] args) {
    		
    		String stuName1 = "홍길동";
    		int stuAge1 = 15;
    		int stuGrade1 = 90;
    
    		String stuName2 = "장발장";
    		int stuAge2 = 16;
    		int stuGrade2 = 80;
    		
    		System.out.println("이름 : " + stuName1 + " 나이 : " + stuAge1 + "세 성적 : " + stuGrade1 + "점");
    		System.out.println("이름 : " + stuName2 + " 나이 : " + stuAge2 + "세 성적 : " + stuGrade2 + "점");
    		
    		// 위 방식은 학생이 늘어 날 때마다 변수와 출력 코드를 계속 추가해야하는 문제가 생김!!
    		// 같은 의미의 변수지만 같은 이름을 사용할 수 없기 때문에 변수가 계속 늘어남
    		
    		// 위 문제점을 배열을 사용해 해결해보자
    	}
    }
    ```
    

---

- 배열을 사용해서 정보들을 저장하려고 함.
    - 정보가 늘어 날 때마다 뭔가를 추가할 필요도 없음.
    - 출력 또한 반복문을 사용해서 원활하게 출력할 수 있음.
    - 하지만 배열은 데이터의 변경과 삭제가 굉장히 어려워짐.
    - 따라서 클래스라는 개념이 등장하게 됨!
    
    ---
    
- **ClassStart2**
    
    ```java
    package class1;
    
    public class ClassStart2 {
    					
    	public static void main(String[] args) {
    		
    		// 배열을 사용하여 코드를 다시 작성하였을 때
    		// 1. 학생이 추가되어도 배열에 데이터만 추가하면 됨. (변수 추가 X)
    		// 2. 출력을 반복문을 통해 배열을 순차적으로 탐색하므로, 학생이 추가되어도 출력 코드를 추가할 필요가 없음.
    		
    		// 변수 및 출력문을 추가할 필요 없이 배열에 값을 추가만하면 출력이 됨 -> 문제 해결
    		
    		String[] stuNames = { "홍길동", "장발장", "임꺽정", "로미오" };
    		int[] stuAges = { 15, 16, 17, 20 };
    		int[] stuGrades = { 90, 80, 99, 70 };
    		
    //		String studentName1 = "홍길동";
    //		int studentAge1 = 15;
    //		int studentGrade1 = 90;
    //
    //		String studentName2 = "장발장";
    //		int studentAge2 = 16;
    //		int studentGrade2 = 80;
    		
    //		System.out.println("이름 : " + stuName1 + " 나이 : " + stuAge2 + "세 성적 : " + stuGrade1 + "점");
    
    		for (int i = 0; i < stuNames.length; i++)
    			System.out.println("이름 : " + stuNames[i] + " 나이 : " + stuAges[i] + "세 성적 : " + stuGrades[i] + "점");
    		
    		// 위 방식은 코드 변경은 최소화 되었으나 한 학생의 데이터가 3개의 배열로 나눠서 관리가 됨.
    		// 데이터를 변경, 삭제할 때 매우 조심히 작업을 해야함.
    		// 따라서 위와 같은 코드는 컴퓨터가 볼 때는 전혀 문제가 없지만 사람이 관리하기엔 좋은 코드는 아님.
    		
    		// 그래서 클래스를 도입함!!
    		// 클래스를 사용해 학생이라는 개념을 만들고, 각각의 학생별로 본인의 이름, 나이, 성적을 관리함!!
    	}
    }
    ```
    

---

### 클래스 사용

---

- **Student**
    
    <aside>
    💡 **해당 클래스는 학생의 정보들을 관리하는 필드만 있는 클래스임. → main 메소드 필요 X**
    
    </aside>
    
    ---
    
    ```java
    package class1;
    
    public class Student {
    
    	String stuName;
    	int stuAge;
    	int stuGrade;
    }
    
    /*
     * class 키워드를 사용해서 학생 클래스를 정의함!
     * 학생 클래스는 내부에 이름, 나이, 성적 변수를 가짐
     * 이렇게 클래스 내에 정의한 변수들을 멤버 변수 혹은 필드라고 함.
     * 
     * - 멤버 변수 : 특정 클래스에 소속된 "멤버"이기 때문에 사용함.
     * - 필드 : 데이터 항목을 가르키는 전통적인 용어임. (엑셀, DB 등에서 데이터 각각의 항목을 필드라고 부름.)
     */
    ```
    

---

### 참조 값을 변수에 보관하는 이유

---

- 객체를 생성하는 new Student() 코드 자체에는 이름이 없음.
- 이 코드는 단순히 Student 클래스를 기반으로 메모리에 실제 객체를 만드는 기능만 함.
- 따라서 생성한 객체에 접근할 방법이 필요함.

---

- 객체를 생성할 때 반환되는 참조값 (주소)를 알면 객체에 접근할 수 있음.
- 따라서 반환되는 참조값 (주소)를 저장할 변수가 필요하며
- 앞서 Student stu1로 선언한 변수 (stu1)에 참조값을 저장하여 필요할 때 객체에 접근할 수 있음.

---

### 정리

- Student stu1 = new Student(); // Student 객체 생성
- → Student stu1 = 0x0099ff; // new Student()의 결과로 참조값(주소) 반환
- stu1 = 0x0099ff; // stu1 변수에 주소값이 저장됨.

---

- **ClassStart3**
    
    ```java
    package class1;
    
    public class ClassStart3 {
    					
    	public static void main(String[] args) {
    
    		// 클래스를 사용하는 것이기 때문에 본체를 직접 접근해서 사용하면 데이터가 삭제되거나 할 수 있음.
    		// -> 클래스의 복사본을 가져다가 사용함.
    		Student stu1 = new Student(); // 메모리에 학생 클래스를 생성하여 stu1에 담아둠.
    		
    		// .(닷) = 해당 인스턴스 변수의 클래스로 접근함.
    		stu1.stuName = "홍길동";
    		stu1.stuAge = 15;
    		stu1.stuGrade = 90;
    		
    		Student stu2 = new Student();
    		
    		stu2.stuName = "장발장";
    		stu2.stuAge = 16;
    		stu2.stuGrade = 80;
    
    		System.out.println(stu1);
    		System.out.println(stu2);
    		
    		System.out.println("이름 : " + stu1.stuName + " 나이 : " + stu1.stuAge + "세 성적 : " + stu1.stuGrade + "점");
    		System.out.println("이름 : " + stu2.stuName + " 나이 : " + stu2.stuAge + "세 성적 : " + stu2.stuGrade + "점");
    	}
    }
    
    /*
     * 클래스와 사용자 정의 타입
     * - 타입 : 데이터의 종류나 형태를 나타냄.
     * - int는 정수 타입, String은 문자 타입
     * 
     * 클래스의 탄생 이유
     * - 학생 (Student)라는 타입을 만들면 좋지 않을까?
     * - 클래스를 사용하면 int, String과 같은 타입을 직접 생성할 수 있음.
     * - 사용자가 직접 정의하는 사용자 정의 타입을 만드려면 설계도가 필요하고, 이 설계도가 클래스임.
     * - 설계도인 클래스를 사용하여 실제 메모리에 만들어진 실체를 객체 또는 인스턴스라고 함.
     * - 클래스를 통해서 사용자가 원하는 종류의 데이터 타입을 마음껏 정의할 수 있음.
     * 
     * 참조 값을 변수에 보관하는 이유
     * 객체를 생성하는 new Student() 코드 자체에는 이름이 없음
     * 이 코드는 단순히 Student 클래스를 기반으로 메모리에 실제 객체를 만드는 기능만 함.
     * 띠라서 생성한 객체에 접근할 방법이 필요함.
     * 
     * 객체를 생성할 때 반환되는 참조값 (주소)를 알면 객체에 접근할 수 있음.
     * 따라서 반환되는 참조값 (주소)를 저장할 변수가 필요하며
     * 앞서 Student stu1로 선언한 변수(stu1)에 참조값을 저장하여 필요할 때 객체에 접근할 수 있음.
     * 
     * 정리
     * Student stu1 = new Student(); // Student 객체 생성
     * -> Student stu1 = 0x0099ff; // new Student()의 결과로 참조값(주소) 반환
     * stu1 = 0x0099ff; // stu1 변수에 주소값이 저장됨.
     */
    ```
    

---

### 배열을 이용한 클래스 사용

---

- **ClassStart4**
    
    ```java
    package class1;
    
    public class ClassStart4 {
    					
    	public static void main(String[] args) {
    
    		Student stu1 = new Student();
    		
    		stu1.stuName = "홍길동";
    		stu1.stuAge = 15;
    		stu1.stuGrade = 90;
    		
    		Student stu2 = new Student();
    		
    		stu2.stuName = "장발장";
    		stu2.stuAge = 16;
    		stu2.stuGrade = 80;
    		
    		// Student 타입의 2칸 짜리 배열 생성
    		Student[] students = new Student[2];
    		
    		// 배열에 값을 할당함.
    		students[0] = stu1;
    		students[1] = stu2;
    		
    		System.out.println(students[0].stuName);
    	}
    }
    
    /*
     * 005 = 배열의 주소 / 001 = 객체의 주소
     * System.out.println(students[0].stuName); // 배열 접근 시작
     * System.out.println(005[0].stuName); [0]을 사용해서 005 배열의 0번 요소에 접근
     * System.out.println(001.stuName); .(dot)을 사용해서 참조값으로 객체에 접근
     * System.out.println("홍길동");
     */
    ```
    
- **ClassStart5**
    
    ```java
    package class1;
    
    public class ClassStart5 {
    					
    	public static void main(String[] args) {
    
    		// 리팩토링
    		// 1. 선언 단일화 (배열로만 접근 가능하게 함.)
    		// 2. 출력문구를 반복문을 통해 심플하게 변경
    		
    		Student[] students = new Student[2];
    		
    //		Student stu1 = new Student();
    //		Student stu2 = new Student();
    		
    		// 따로 변수를 생성하지 않고 배열에 값을 선언함.
    		students[0] = new Student();
    		students[1] = new Student();
    		
    		// 값 할당
    		students[0].stuName = "홍길동";
    		students[0].stuAge = 15;
    		students[0].stuGrade = 90;
    
    		students[1].stuName = "장발장";
    		students[1].stuAge = 16;
    		students[1].stuGrade = 80;
    		
    		// for문을 이용한 출력
    		for (int i = 0; i < students.length; i++)
    			System.out.println("이름 : " + students[i].stuName + " 나이 : " + students[i].stuAge + "세 성적 : " + students[i].stuGrade + "점");
    		
    		System.out.println();
    		
    		// for-each문 사용
    		for (Student student : students)
    			System.out.println("이름 : " + student.stuName + " 나이 : " + student.stuAge + "세 성적 : " + student.stuGrade + "점");
    	}
    }
    ```
    

---

### 예제

---

- **요구사항**
    
    ---
    
    ### ProductOrder
    
    ---
    
    - **멤버변수**
        1. **productName (상품명)**
        2. **price (가격)**
        3. **quantity (주문 수량)**
    
    ### ProductOrderMain
    
    ---
    
    - **클래스 안에 main() 메소드를 포함함.**
    - **여러 상품의 주문 정보를 배열로 관리함.**
    - **그 정보를 출력하고, 최종 결제 금액을 계산하여 출력함.**
    - **입력값**
        
        
        | 상품명 | 가격 | 주문 수량 |
        | --- | --- | --- |
        | 두부 | 2000 | 2 |
        | 김치 | 5000 | 1 |
        | 콜라 | 1500 | 2 |
    - **출력 예시**
        
        ```
        상품명: 두부, 가격: 2000, 수량: 2
        상품명: 김치, 가격: 5000, 수량: 1
        상품명: 콜라, 가격: 1500, 수량: 2
        총 결제 금액: 12000
        ```
        
    
    ---
    
    - **ProductOrder**
        
        ---
        
        ```java
        package class1;
        
        public class ProductOrder {
        
        	String productName;
        	int price;
        	int quantity;
        }
        ```
        
    - **ProductOrderMain**
        
        ---
        
        ```java
        package class1;
        
        public class ProductOrderMain {
        
        	public static void main(String[] args) {
        		
        	 	ProductOrder[] orders = new ProductOrder[3];
        
        		int total = 0;
        		
        		orders[0] = new ProductOrder();
        		orders[1] = new ProductOrder();
        		orders[2] = new ProductOrder();
        		
        		orders[0].productName = "두부";
        		orders[0].price = 2000;
        		orders[0].quantity = 2;
        		
        		orders[1].productName = "김치";
        		orders[1].price = 5000;
        		orders[1].quantity = 1;
        		
        		orders[2].productName = "콜라";
        		orders[2].price = 1500;
        		orders[2].quantity = 2;
        		
        		for (ProductOrder order : orders) {
        			System.out.println("상품명: " + order.productName + ", 가격: " + order.price + ", 수량: " + order.quantity);
        			total += order.price * order.quantity;
        		}
        		 
        		System.out.println("총 결재 금액: " + total);
        	}
        }
        
        ```
